[
  {
    "id": 1,
    "principle": "Spacing",
    "subtitle": "Space practice across time > Mass practice all at once",
    "categoryId": 1,
    "categoryName": "Memory/Fluency",
    "related": "15",
    "questions": "When do players get opportunities to practice skills in your game?\nHow often do you want your player to practice key skills?\nHow many times will they be exposed to each key skill?\nHow much time will it require for players to complete practicing?\nWhat is the minimum required time for one set of practices?",
    "description": "Leave some time in between practice. \nLearning is better from spaced practice items than from massed practice items; The result is generally only seen on a delayed test.",
    "examples": "Studying for 1 hour a day for 12 days > Cramming for a test for 12 hours the day before\nHave a practice session after each instructional session > Have a big practice session at the end of the module\nReview several weeks later > Give students a review of course material the day after it is first presented",
    "exampleGame": "Duolingo",
    "exampleGameUrl": "https://www.duolingo.com/",
    "exampleGameDesc": "Duolingo is a mobile app for learning languages. Duolingo encourages users to take a break in between lessons by providing incentives for “streaks” of practicing for multiple days in a row.",
    "cited": "Pashler"
  },
  {
    "id": 2,
    "principle": "Scaffolding",
    "subtitle": "Sequence instruction toward higher goals > No sequencing",
    "categoryId": 1,
    "categoryName": "Memory/Fluency",
    "related": "5",
    "questions": "What are the skills that players will be learning from your game?\nWhat are additional skills that a player needs to successfully apply those skills?\nWhat are additional skills that a player needs to successfully apply THOSE skills?\nHow can you build up these smaller skills to support the bigger ones?\nHow do you know the player is ready for the next step?\nDoes your player know that these small pieces will build up to bigger ones?
",
    "description": "Structure content modularly. \nSupport learners by breaking a big concept into small pieces when introducing new concepts, and build towards a higher goal.",
    "examples": "Learn to draw contours and break objects down into shapes > Draw a human figure in high fidelity\nTeach a player to do a jump in level 1, doublejump in level 2, backflip in level 3, and double-jump backflip in level 4 > Teach double-jump backflip in level 1",
    "exampleGame": "Minecraft",
    "exampleGameUrl": "https://www.minecraft.net/en-us/",
    "exampleGameDesc": "Minecraft is a popular open-ended game in which players explore the iconic, randomly generated, blocky terrain and break down resource blocks in order to combine them to build new things. Minecraft’s advancements tree is structured in a way that it serves as a walk-through of what to do next. Previous achievements make further achievements possible, often by producing resources needed to build further items."
  },
  {
    "id": 3,
    "principle": "Exam expectations",
    "subtitle": "Students expect to be tested > No testing expected",
    "categoryId": 1,
    "categoryName": "Memory/Fluency",
    "related": "4, 7",
    "questions": "Is the goal of your game aligned with the goal of the players’ goal?\nWhat does the player need to learn to succeed in your game?\nDoes the player feel that those things are necessary to succeed in your game?
",
    "description": "Make it clear how key concepts being learned will be put to use later.",
    "examples": "Tell your 6th grade class that there will be a quiz on this reading > Tell them to do the reading because it will better them as a student\nWhen teaching a player to perform a function, provide some examples of future tasks that this skill is needed to complete (“double jump: used for collecting butterflies”) > Teach the function in a vacuum",
    "exampleGame": "Crazy Plant Shop",
    "exampleGameUrl": "https://www.filamentlearning.com/products/heredity-unit-crazy-plant-shop",
    "exampleGameDesc": "Crazy Plant Shop is a plant genetics learning game aligned to Common Core and Next Generation Science standards. Players need to fulfill customer orders using the knowledge of trait inheritance and plant genetics. The game tells players they will receive mysterious customers’ orders in the very beginning, so players would learn more engagingly."
  },
  {
    "id": 4,
    "principle": "Quizzing",
    "subtitle": "Quiz for retrieval practice > Study same material",
    "categoryId": 1,
    "categoryName": "Memory/Fluency",
    "related": "3, 7",
    "questions": "Where do players exercise the skills they are learning in your game?\nDo they have to exercise those skills repeatedly?\nHow often are they exposed to the tests?
",
    "description": "Re-expose players to core concepts by asking them to recall material. \nChallenges make learning and retrieval effortful and thereby have positive effects on long-term retention.  ",
    "examples": "Give a test summarizing the material > Spend additional time studying the same material\nGive a “pre-quiz” to expose students to upcoming math concepts and gauge progress > Jump straight in\nHave a weekly quiz>don’t have any quiz before the final test\nUsing flashcards to recall vocabulary learned before every day > Only recall the material learned today
",
    "exampleGame": "Battleship Numberline",
    "exampleGameUrl": "https://www.brainpop.com/games/battleshipnumberline/",
    "exampleGameDesc": "Battleship Numberline is one of many K-12 math games that takes an approach of repetitive drilling (or quizzing) to ingrain concepts in the player’s mind. After learning new skills about math, the questions about old skills are still in the quizzes. Time pressure and a display of average accuracy put some heat on the player.",
    "cited": "Pashler"
  },
  {
    "id": 5,
    "principle": "Segmenting",
    "subtitle": "Present lesson in learner-paced segments > As a continuous unit",
    "categoryId": 1,
    "categoryName": "Memory/Fluency",
    "related": "1, 2",
    "questions": "How will the game adjust to players with different learning paces? \nWhat is the order of these learning units? Can players control it?
",
    "description": "Break material down into units in order to allow the player/learner to approach the material at their own pace. \nPlan the order and amount of new information that is to be presented in discrete units so as not to overwhelm new players with too much new information at once. Also, players don’t have to play the entire game to get the benefit.",
    "examples": "Levels > One very long game\nA series of Portuguese verb lessons on verbs used in different scenarios>a very long, continuous curriculum on all Portuguese verbs"
  },
  {
    "id": 6,
    "principle": "Feedback",
    "subtitle": "Provide feedback during learning > No feedback provided",
    "categoryId": 1,
    "categoryName": "Memory/Fluency",
    "related": "14",
    "questions": "What are all the channels the game is using to communicate status to the player?\nHow many feedbacks relate to their application of target concepts?\nHow does a player know how they are doing?\nHow often should the feedback be provided?",
    "description": "Provide feedback to the player on their performance as they are learning.\nTiming of feedback may differ depending on the task being performed. Immediate feedback during play can be valuable to encourage or discourage behavior.",
    "examples": "A teacher provides detailed feedback on an essay > Just a letter grade",
    "exampleGame": "JobPro: Get Dressed!",
    "exampleGameUrl": "https://www.simcoachgames.com/jobpro/",
    "exampleGameDesc": "JobPro: Get Dressed! Is a mobile game created by Simcoach Games that trains players in how to dress for a job interview. Players choose an outfit based on the role they are interviewing for, the atmosphere of the company, and various other factors. After the player makes their selection they receive detailed feedback about the outfit they chose and its compatibility with the position.",
    "cited": "Graesser"
  },
  {
    "id": 7,
    "principle": "Pretraining",
    "subtitle": "Practice key prior skills before lesson > Jump in",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "13",
    "questions": "What prior skills are required for this specific lesson?\nHow can these prior skills be practiced effectively before the lesson?\nMultiple short practices or one long practice?\nHow well should the players be trained in those prior skills?",
    "description": "Provide some exposure to key concepts before the actual lesson.\nLearners receive prior instruction concerning the components in the to-be-learned system.",
    "examples": "Introduce the components of a car’s braking system before showing a narrated animation explaining how a car’s braking system works > Directly show the narrated animation\nList the new vocabulary before learning a new article > learning a new article directly\nMake players practice writing one sentence at a time > Write a paragraph",
    "exampleGame": "Coding for Carrots",
    "exampleGameUrl": "https://www.google.com/doodles/celebrating-50-years-of-kids-coding",
    "exampleGameDesc": "Coding for Carrots is a drag-and-drop coding game that tells a story of a rabbit searches for carrots by completing the block building activity. There is a trial round before every official game. It offers pretraining of the skills that the game wants to test, and it also helps to set an expectation of the difficulty level for the players.",
    "cited": "Pashler"
  },
  {
    "id": 8,
    "principle": "Worked example",
    "subtitle": "Worked examples + problem-solving practice > Practice alone",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "27",
    "questions": "What is the practice that needs a worked example in your game?\nHow many or what type of worked examples can be provided for this lesson?\nHow to show the problem-solving process of the worked example to players?
",
    "description": "Combine problem-solving practice with reviewing examples of solved problems that illustrate the steps taken to reach a solution.\nHaving students alternate between reviewing worked examples and solving similar problems on their own has been shown to be effective when teaching math, science, and technology.",
    "examples": "A computer science student reviews code from a few similar projects while determining what approach she will take to do her homework assignment > She looks at the assignment and thinks about it really hard\nAn algebra textbook provides a worked example for each type of practice problem, using different variables and values > Descriptive text and practice problems only",
    "exampleGame": "Anti-Phishing Phil",
    "exampleGameUrl": "https://www.wombatsecurity.com/anti-phishing-training-suite",
    "exampleGameDesc": "Anti-Phishing Phil is a game that teaches users how to identify phishing URLs, where to look for cues in web browsers, and how to use search engines to find legitimate sites. Each module of the game begins with a non-interactive tutorial in which the player is presented with several worked examples of the types of problems they will need to solve.\n\nAnti-Phishing Phil was developed by members of the Carnegie Mellon University Usable Privacy and Security Laboratory with funding from the US National Science Foundation (Cyber Trust initiative) and ARO/CyLab.",
    "cited": "Pashler"
  },
  {
    "id": 9,
    "principle": "Concreteness fading",
    "subtitle": "Concrete to abstract representations > Starting with abstract",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "8, 25",
    "questions": "What are some concrete/abstract representations of your target concepts?\nWhat are some ways of bridging the concrete and abstract representations?\nHow can you show the players this bridging? By visual instruction, text feedback or other ways?",
    "description": "Introduce a concept with concrete examples, and over time replace key components of that example with more abstract representations.、nWhen explaining key concepts, use both abstract and concrete representations. Let players draw abstract connections between concrete examples, and highlight how they represent the same critical takeaways.
",
    "examples": "“Shelly needs 3 dozen eggs. X = the number of eggs she needs.” > “X = 3(12). “\nPlay through the circle of 5ths on piano while following along on the diagram > Review a diagram of the circle of 5ths\nChocolate bar split into 4 equal pieces > ¼ ",
    "cited": "Pashler"
  },
  {
    "id": 10,
    "principle": "Guided attention",
    "subtitle": "Words include cues about organization > No organization cues",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "19, 22",
    "questions": "Ideally, what would I like the players to do?\nAre there any scenes that contain many visual elements? \nWhat are the most important components of the scene that players need to attend to?\nHow can you emphasize them more?",
    "description": "Provide explicit indicators as needed to help the player anticipate where they should focus their attention.\nWhen there are many elements provided on the screen, the cognitive load of learning might be high if people don’t know where to pay attention to. Here they need some visual cues, for example, outlining, to help them reduce the cognitive load. Also, as a designer, it is a good way to help ensure your players do what you want them to do of their own free will.
",
    "examples": "A game with a tutorial and instructions > No text\nAn article with an outline and headings > A long article without any outline or headings",
    "exampleGame": "Creature Capture",
    "exampleGameUrl": "http://play.centerforgamescience.org/creaturecapture/",
    "exampleGameDesc": "Creature Capture is a strategy game published by the University of Washington Center for Game Science. It teaches young children to compare their game fraction values with those of the computer-controlled virals. \nTo win the game, the player needs to pick a number that meets the requirement of the presented game cue. The game's interactive tutorial walks the player through each step of a round."
  },
  {
    "id": 11,
    "principle": "Linking",
    "subtitle": "Integrate instructional components > No integration",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "2, 5",
    "questions": "How would a player describe what they learned from this game?\nWhat are some links between concepts your game teaches?\nHow important is it to explicitly draw connections?\nHow can you make the connections more explicit?",
    "description": "Highlight connections between instructional units. \nExplicitly call out connections, similarities, and differences between previously learned and new material. Learning is facilitated when new knowledge is integrated into the learner’s world.",
    "examples": "In a philosophy course, make connections between philosophers and how their beliefs about key topics compare and contrast > Give an overview of each major philosopher\nLink the facts 2 + 3 = 5 in math with coordinate axis > teach the fact 2+3=5 and coordinate axis separately",
    "exampleGame": "Human Resource Machine",
    "exampleGameUrl": "https://tomorrowcorporation.com/humanresourcemachine",
    "exampleGameDesc": "Human Resource Machine is a puzzle game that teaches programming. The player controls tiny office workers with simple programming to perform tasks dictated by a cruel manager. Each level builds upon the one before it and incorporates previously learned commands, explaining how the commands relate to each other and work together.\n"
  },
  {
    "id": 12,
    "principle": "Goldilocks",
    "subtitle": "Instruct at intermediate difficulty level > Too hard or too easy",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "13, 30",
    "questions": "Who is your target player? \nHow much prior exposure do they have to this material?\nHow could you make the material harder? Easier?",
    "description": "Account for the player’s prior knowledge and skill level when considering how challenging to make your game. When the game is too easy for the player, the student is not challenged and may get bored. When it is too difficult, the student acquires very little and gets frustrated or tunes out.",
    "examples": "Grade-level appropriate curriculum > Students find a chemistry game completely unapproachable because it involves math far above their grade level",
    "exampleGame": "Mario Kart",
    "exampleGameUrl": "https://www.nintendo.com/",
    "exampleGameDesc": "The classic multiplayer Nintendo game Mario Kart uses a unique approach to balancing the different skill levels of players. The game would give more powerful items, which are used to sabotage other players, to players who are performing not so good, to reduce the difficulty.",
    "cited": "Graesser"
  },
  {
    "id": 13,
    "principle": "Activate preconceptions",
    "subtitle": "Cue student's prior knowledge > No prior knowledge cues",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "9, 12, 5, 2, 11",
    "questions": "What kinds of prior knowledge are required for this practice?\nWhat do your players already know about the concept you will introduce?\nWhat are some links between the prior knowledge and the new concepts?\nHow to help players recall the links?\nHow can you help your players see those concepts in a new way?",
    "description": "Prompt players to examine what they already know (or think they know) to help contextualize new material.\nBuilding upon what your player already knows and/or is interested in can make the game accessible and engaging. ",
    "examples": "Ask students to think about examples of vaporization in daily life before introducing the theory of vaporization > Introducing the theory of vaporization directly\nWhen explaining photosynthesis to a child, use a metaphor of how a person drinks milk through a straw like how a plant drinks water through its stem > Explain a brand new concept from scratch",
    "exampleGame": "A Slower Speed of Light",
    "exampleGameUrl": "http://gamelab.mit.edu/games/a-slower-speed-of-light/",
    "exampleGameDesc": "A Slower Speed of Light is a first-person game prototype developed by MIT Game Lab. A Slower Speed of Light is designed to build upon and challenge the average person’s understanding of how light travels. It begins with a very familiar experience: walking through a space at a human-like pace collecting objects. Picking up orbs reduces the speed of light in increments, triggering scientifically accurate visual effects."
  },
  {
    "id": 14,
    "principle": "Immediate Feedback timing",
    "subtitle": "Immediate feedback on errors > Delayed feedback",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "6",
    "questions": "When players make mistakes, how do they know they’ve done so? When do you tell them? How long can a player go before realizing they need to turn back?\nAre the errors immediately fixable? Or does it take more time to fix the error?\nHow do players feel when fixing the error? How to make the fixing error experience more joyful?",
    "description": "Provide immediate feedback on errors.\nLearning wrong information can be reduced when feedback is immediate. By correcting mistakes as soon as possible, players will be allowed to revise their memory and understanding without delay.",
    "examples": "A musician plays a wrong note on guitar and hears the dissonance > A musician makes a mistake writing sheet music and later notices when playing through the line\nA child touches a hot skillet and burns her hand > A child knocks over a vase and is later scolded\nA computer science student makes a mistake and the line turns red as they type > The student presses the “compile” button, and gets an error message",
    "exampleGame": "Operation",
    "exampleGameUrl": "https://shop.hasbro.com/en-us",
    "exampleGameDesc": "Operation is a classic board game in which players perform “surgery” on a doll-shaped board, carefully extracting plastic objects from the body with a goal of not touching the board. If the player slips up and makes contact with the board a buzzer sounds immediately."
  },
  {
    "id": 15,
    "principle": "Interleaving",
    "subtitle": "Intermix practice on different skills > Block practice all at once",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "1, 4",
    "questions": "What are different types of skills to be practiced?\nHow do you currently present them to players?\nHow to design for players to practice different skills together?",
    "description": "Practice different skills at the same time, or in alternation.\nInterleaving will balance the speed (reduced time cost of practice) advantage of recency with the long-term learning advantage of spaced practice. It will lead to better long-term retention in general.",
    "examples": "A dance teacher choreographs a piece combining different techniques that the class has learned this month for them to practice > Additional practice of the same techniques\nA yoga class mixes both yin and yang practices > Long holds only\nPracticing vocabulary based on the forgetting curve theory > Practice today’s new vocabulary only",
    "exampleGame": "Ninja Kitchen",
    "exampleGameUrl": "https://ninjakitchengame.org/",
    "exampleGameDesc": "Ninja Kitchen is a restaurant serving game focusing on food safety. The player role plays a ninja server, and he/she learns to operate the restaurant through a mixture of smaller games targeting different perspectives, including dish washing, food preparing, serving, etc. The harder the game goes, the busier the restaurant runs. The players will practice all kinds of skills in later levels."
  },
  {
    "id": 16,
    "principle": "Application",
    "subtitle": "Practice applying new knowledge > No application",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "3",
    "questions": "How much practice will it take for your player to understand the material?\nWhat are the components that are most important to remember?\nHow to design tasks to help the players practice the same skills under different contexts?",
    "description": "Challenge the player to put their newly acquired knowledge to use solving problems. \nChallenge the player to put their newly acquired knowledge to use solving problems. Knowledge acquiring and applying in varying contexts. ",
    "examples": "Practice playing newly learned chords on guitar > Study additional new chord shapes",
    "exampleGame": "Septris",
    "exampleGameUrl": "http://med.stanford.edu/septris/",
    "exampleGameDesc": "Septris is an educational tool created by Stanford Hospital to train medical and surgical staff to diagnose, classify, and treat sepsis according to best practices. In the game, players need to apply sepsis skills in the case scenarios.",
    "cited": "Merrill"
  },
  {
    "id": 17,
    "principle": "Variability",
    "subtitle": "Practice with varied instances > Similar instances",
    "categoryId": 2,
    "categoryName": "Induction/Refinement",
    "related": "15, 18",
    "questions": "Are you encouraging thinking about this concept from different perspectives?\nHow to design tasks to help the players practice the same skills under different contexts?",
    "description": "Use multiple and varied examples to teach and practice the use of abstract concepts.\nNo two situations are ever exactly the same, so you should prepare your players to apply their knowledge in all the varied situations of life. ",
    "examples": "Point out the same music theory concept in classical, pop, and jazz music examples > Use only examples of classical music\nA parent explains a complex concept to a child using several varied metaphors > Use one example, and the child interprets it literally",
    "exampleGame": "Battleship Numberline",
    "exampleGameUrl": "https://www.brainpop.com/games/battleshipnumberline/",
    "exampleGameDesc": "Battleship Numberline is a game that prompts children to practice eyeballing ratios by marking a spot on a numberline. The game has modes for fractions, decimals, percentages, and \"mixed bag,\" prompting the player to apply the same skills to varied problems.",
    "cited": "Graesser"
  },
  {
    "id": 18,
    "principle": "Comparison",
    "subtitle": "Compare multiple instances > Only one instance",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "17",
    "questions": "WWhat are some commonalities across all variables of instances?\nHow to show the players the similarities/differences among concepts in your game?\nHow can the game encourage players to find similarities/differences among the skills/concepts in the game? ",
    "description": "Use multiple examples to explain a new concept, and highlight similarities and differences between the examples.\nPeople comparing their performance in two attempts doesn’t account as an application of this principle, because it is not helping players understand a new concept from external materials. ",
    "examples": "Point out the same music theory concept in classical, pop, and jazz music examples, and point out similarities and differences in how it is used > Use only examples of classical music",
	"exampleGame": "Spent",
    "exampleGameUrl": "http://playspent.org/",
    "exampleGameDesc": "Spent is a game to tell people why people struggling in poverty need external help. Players will occur a series of events to see how hard it is to make a living in poverty. By showing the impact of poverty on education, healthcare, housing, job hunting,etc, the game helps learners understand the importance of financial assistance to poor people.",
  },
  {
    "id": 19,
    "principle": "Multimedia",
    "subtitle": "Graphics + verbal descriptions > Verbal descriptions alone",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "20, 21, 2, 23",
    "questions": "Is there any scene in your game that is too wordy?\nCould you make your game more visual?\nHow can you visually represent the concept of your game better?",
    "description": "Use visual aids to enhance verbal descriptions. \nWhen words and pictures are both presented, learners have an opportunity to construct verbal and visual mental models and to build connections between them.",
    "examples": "A visualization of median income by state > A list alone\nA labeled map accompanying a description of Egyptian trade routes > Description alone",
    "cited": "Pashler"
  },
  {
    "id": 20,
    "principle": "Modality principle",
    "subtitle": "Verbal descriptions presented in audio > In written form",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "19, 21, 22, 23",
    "questions": "How could you use audio to replace some textual presentation in your game?\nHow could you use audio and graphic to present things in your game?\nIs it easy for all your players to access the information?",
    "description": "People learn more deeply from pictures and spoken words than from pictures and printed words alone. \nPlayers may find their attention divided when presented with written text and competing visuals simultaneously.",
    "examples": "A safety training course with spoken narration > Written instructions\nWatching a documentary with sound > On mute with subtitles",
    "exampleGame": "Feed the Dingo",
    "exampleGameUrl": "https://pbskids.org/plumlanding/games/ecosystem/feed_the_dingo.html",
    "exampleGameDesc": "A desert system game to build an ecosystem in an Australian desert. Players learn how plants and animals in the ecosystem influence each other through the game. In the game, all the notice and feedback to the ecosystem are given by audio and aligned with the view on the interface.",
    "cited": "Pashler"
  },
  {
    "id": 21,
    "principle": "Redundancy",
    "subtitle": "Verbal descriptions in audio > Both audio & written",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "19, 20, 22, 23",
    "questions": "What descriptions can or cannot be fully presented in audio?\nShould the verbal descriptions be completely or partially removed?\nIs it easy for all your players to access the information?",
    "description": "If you are able to provide verbal descriptions in audio, refrain from also including those same instructions in written form. People learn better from graphics and narration than from graphics, narration, and printed text.\nBecause (a) the visual channel can become overloaded by having to visually scan between pictures and on-screen text, and (b) because learners expend mental effort in trying to compare the incoming streams of printed and spoken text.
",
    "examples": "Watching a documentary with sound > Sound and subtitles\nA presentation that is delivered verbally with accompanying visuals, but no text > Redundant text\nA learner views a narrated animation on lightning formation > a narrated animation along with concurrent onscreen captions that contain the same words as in the narration"
  },
  {
    "id": 22,
    "principle": "Spatial contiguity",
    "subtitle": "Present description next to image element described > Separated",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "10",
    "questions": "What are some presented images that require verbal descriptions?\nWhat are the images that learners are not familiar with?\nAre there any informative visual components that cannot be understood without text?\nHow could you format/place the description relative to the image?\nWhat is the purpose of the description for the image? ",
    "description": "Position descriptive text as closely as possible to the part of the visualization it describes.\nWhen corresponding words and pictures are near each other on the page or screen, learners do not have to use cognitive resources to visually search the page or screen, and learners are more likely to be able to hold them both in working memory at the same time.",
    "examples": "A diagram is located inline with the text it supports > Reader has to flip forward several pages to find diagram 1.7\nTooltips are used to provide more information on elements of a data visualization > Visit a \"help\" section for more info\nWhen showing three new concepts that related to each other, shows the description next to the introductive image > Showing the three introductive images first, then give their description together\nTooltips are used to provide more information on elements of a data visualization > not use
",
    "cited": "Pashler"
  },
  {
    "id": 23,
    "principle": "Temporal contiguity",
    "subtitle": "Present audio & image element at the same time > Separated",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "questions": "What are the audio & image elements required for this practice?\nWhich audio elements are related to which image elements?\nAre they clearly presented together?",
    "description": "Present complementary audio and visual elements at the same time to encourage the player to form a connection between the two stimuli.\nThe learner is more likely to be able to build mental connections between verbal and visual representations when applying this principle.",
    "examples": "Show photographs from the great depression while lecturing > Photographs reviewed later",
    "cited": "Mayer"
  },
  {
    "id": 24,
    "principle": "Coherence",
    "subtitle": "Extraneous words, pictures, sounds excluded > Included",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "30",
    "questions": "What are all the words, graphics, or sounds in your game?\nWhat are purpose does each of them serve?\nHow do those purposes support your learning goal?\nWhen do the players feel like there’s “too much” information?",
    "description": "Refrain from including extraneous words, pictures, and sounds that do not serve the purpose of your game.\nExtraneous material competes for cognitive resources in working memory and can divert attention from the important material, disrupt the process of organizing the material, and prime the learner to integrate the material with an inappropriate theme.",
    "examples": "A powerpoint presentation contains purposeful words and images only > Includes lots of decorative illustrations that students pay more attention to than the actual lesson\nA passage about removing ticks from animals features an illustration demonstrating proper tick removal technique > A picture of a cute dog",
    "exampleGame": "Euclidea",
    "exampleGameUrl": "https://www.euclidea.xyz/",
    "exampleGameDesc": "Euclidea is a geometric construction building game that values simplicity and mathematical beauty. It has 120 tasks, from the very basics to real challenges. It starts with lines, angle bisectors, and perpendiculars, and then go into inner/outer tangents, hexagons, golden section, etc. There is no extraneous information on the interface. There are varied tasks practicing similar topics so that it will make sure players are fully grasped in what they learn. "
  },
  {
    "id": 25,
    "principle": "Anchored learning",
    "subtitle": "Real-world problems > Abstract problems",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "9, 8",
    "questions": "What do you want the players to obtain in your game and bring back to the real world?\nHow is what the player does in your game like what they would do in real life? How is it different?\nHow will you build the connection between the in-game progress and the real-world life?\nHow can players relate the new skills learned in their own lives?",
    "description": "Engage the player in realistic rather than theoretical problem-solving, and emphasize the connections between the game and the real world.\nLearning to solve a problem involves four levels of instruction: the problem, the tasks required to solve the problem, the operations that comprise the tasks, the actions that comprise the operations.",
    "examples": "Instruct middle schoolers in an economics course to build a hypothetical portfolio of stocks and watch those stocks over the course of the semester > Study fictional problems of market fluctuation\nA student project of building an assistive device for a real person > Building a double transducer\nProblem-based curricula in medical schools where students work on genuine medical cases > work on separate parts of medical cases",
    "exampleGame": "Lift Coach: Plan Your Lift",
    "exampleGameUrl": "https://www.amazon.com/Lift-Coach-Plan-Your/dp/B076FFL8CJ",
    "exampleGameDesc": "Lift Coach is a game that educates people to use safe postures to lift and move objects. Players can correct how on-screen character lifts objects, and the goal is to avoid unsafe actions might lead to injuries. Lifting is such a common daily activity, but not many have paid attention to it. By referring back to real life cases, people will have an easier time to understand the mechanism behind and how to protect themselves in real hard-lifting scenarios.",
    "cited": "Merrill, Culyba"
  },
  {
    "id": 26,
    "principle": "Metacognition",
    "subtitle": "Metacognition supported > No support for metacognition",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "6, 4, 27, 28",
    "questions": "Do the players know what they know before the game?\nHow could your game help learners to manage their knowledge intentionally?\nDo you provide moments for players to reflect on their own knowledge, how could you provide more?",
    "description": "Guide students to think about their own learning processes. \nLearners need explicit training on cognitive processes and optimal learning strategies to allocate study time effectively and become aware of what they do not know. Metacognitive skills will help students transfer to new situations without the need for explicit prompting.",
    "examples": "An elearning course gives the same test at the beginning and end to show the student their progress > No measure of progress\nA time-management app encourages the user to set custom goals and reflect upon their progress on a weekly basis > No opportunity for reflection\nA programming tutorial gives near-immediate feedback on errors in the beginning, and gradually transitions into more delayed feedback to allow the student to recognize and troubleshoot their own mistakes > No opportunity to self-correct",
    "exampleGame": "Survival of the Best Fit",
    "exampleGameUrl": "https://www.survivalofthebestfit.com/game/",
    "exampleGameDesc": "Survival of the Best Fit is a short game designed to teach people to understand algorithmic bias, and prompt them to ask tough questions about their own biases. The game features a series of short segments with periodic breaks to reflect on what just happened and why they made the decisions they made.",
    "cited": "Culyba"
  },
  {
    "id": 27,
    "principle": "Explanation",
    "subtitle": "Prompt for self-explanation > Give explanation > No prompt",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "26, 28",
    "questions": "What are the relationships between the concepts being explored?\nHow does your game explain these relationships?\nAre are players given chances to self-explain how they think these relationships work?",
    "description": "Prompt the player to reason through the underlying explanatory principles relating to the subject matter being explored.\nEncourage the player to reflect upon their own problem-solving process and challenge, explain, and defend their choices.\nExplanations provide coherence to the material and justify why information is relevant and important.",
    "examples": "Have a student show their work on an algebra problem > Show a worked problem > Show solution only",
    "exampleGame": "SET",
    "exampleGameUrl": "https://www.setgame.com/set",
    "exampleGameDesc": "SET is a cognitive, logical reasoning game. A SET is three cards which share a common feature, such as color or shape. The player who finds the most SETs within the timeframe wins the game. Since every player has his/her own understanding of how to make up the SET, each will prompt to explain their thoughts and definition.",
    "cited": "Astleitner, Pashler"
  },
  {
    "id": 28,
    "principle": "Questioning",
    "subtitle": "Time for reflection & questioning > Instruction alone",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "26, 27",
    "questions": "Does the game provide opportunities to reflect?\nIn what ways could a player question themselves through the game?\nHow could you create situations to help the players to question things?\nDoes the game provide chances for players to answer the questions?",
    "description": "Empower your player to embrace and explore uncertainties they encounter. \nEncourage the player to take time to reflect and ask deep questions; questions that stimulate deep explanations, and may challenge their prior beliefs and assumptions. Training students to ask deep questions facilitates comprehension of material.",
    "examples": "Ask students: What is data? What isn’t data? > Ask students: What is the correct data type to use for a single character?\nAsk students: What might the world look like today if the war had ended differently? > Ask students: What year did the American Revolutionary War end?",
    "exampleGame": "Bury me, my love",
    "exampleGameUrl": "http://burymemylove.arte.tv/",
    "exampleGameDesc": "Bury me, my love is a reality-inspired interactive fiction game to help people understand the experience of a Syrian refugee. The players will communicate with the heroine, Nour, and help her on her way to Europe. Players can give advice to Nour and hear from her experience. It is a chance for reflection to see how Nour reacts to the suggestions and what she experienced later.",
    "cited": "Astleitner, Pashler"
  },
  {
    "id": 29,
    "principle": "Cognitive dissonance",
    "subtitle": "Present incorrect or alternative perspective > Only correct",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "18",
    "questions": "How objective or subjective is the material being presented?\nHow can the player make mistakes or misuse of the material?\nDoes the game show the players alternatives to consider?\nHow many ways are there to approach the challenges in your game? How many are players likely to encounter themselves?",
    "description": "Present incorrect or alternative perspectives of the subject matter to afford the player the opportunity to form arguments around key concepts.",
    "examples": "Show an example of a common misconception and explain why it is false > Correct examples only"
    "exampleGame": "Where in the world is Carmen Sandiego?",
    "exampleGameUrl": "https://classicreload.com/where-in-the-world-is-carmen-sandiego.html",
    "exampleGameDesc": "Where in the world is Carmen Sandiego? is an educational game that tests players’ geography knowledge and the ability to bring piecemeal clues together. The game sets in a criminal chasing scenario, and there are questions in each round helping player to find where the criminals are. Other than the correct detective perspective, the game also lists other leading options which players might choose by mistake to help players think about the differences and similarities between geographic sites. ",
  },
  {
    "id": 30,
    "principle": "Interest",
    "subtitle": "Instruction relevant to student interests > Not relevant",
    "categoryId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "13, 24",
    "questions": "Who is your target player? What motivates them?\nCould your players achieve their goal through your game?\nDoes your player have a personal stake in their transformation?",
    "description": "Engage your player by structuring content around their interests and goals. Players who have intrinsic motivations to play the game would make sense of and engage more with the material.",
    "examples": "Allow guitar students to choose their own songs to learn > Forced set of songs",
    "exampleGame": "Cashflow",
    "exampleGameUrl": "https://www.richdad.com/promotions/cashflow-classic-evergreen",
    "exampleGameDesc": "Cashflow is an online investigating game. At the beginning of the game, the player will be assigned an identity including job, salary and saving. Then the player will choose a dream as their goal in the game, for example saving the ocean animals, owning a personal jet, etc. The dream selection based on personal interest will motivate players to earn more money this game. In the game, players could practice buying and selling stocks or investing in real estate for capital gains or cash flow.",
    "cited": "Culyba"
  }
]
