[
  {
    "id": 1,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Spacing",
    "subtitle": "Leave some time in between practice -- space it out. ",
    "description": "Leave some time in between practice. Learning is better from spaced practice items than from massed practice items, though the result is generally only seen on a delayed test.",
    "summary": "Space practice across time > mass practice all at once",
    "questions": "How often do you want your player/learner to practice key skills?\n\nHow many times will they be exposed to each key skill?\n\nHow much time will pass before they get a chance to practice the skill again?",
    "examples": "Study 1 hour a day for 12 days, rather than cramming for 12 hours the day before test\n\nHave a practice session after each instructional session, rather than a big practice session at the end of the whole module\n\nDuolingo, an app for learning languages, encourages users to take a break in between lessons by providing incentives for “streaks” of practicing for multiple days in a row."
  },
  {
    "id": 2,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Sequence Scaffolding",
    "subtitle": "Gradually build up the content -- scaffold the learning process. ",
    "description": "Structure content modularly. Support players/learners by breaking a big concept into small pieces when introducing new concepts, and build towards a higher goal.",
    "summary": "Sequence instruction toward higher goals > no sequencing",
    "questions": "What are additional skills that a player/learner needs to successfully apply THOSE skills?\n\nHow can you build up these smaller skills to support the bigger ones?\n\nHow do you know the player/learner is ready for the next step?\n\nDoes your player/learner know that these small pieces will build up to bigger ones?",
    "examples": "Teach jump in level 1,  double jump in level 2, backflip in level 3, and double-jump backflip in level 4, rather than teaching double-jump backflip in level 1\n\nTeach to draw contours and break objects down into shapes first, rather than drawing a human figure in high fidelity\n\nIn Minecraft, an open-ended game in which players/learners can break down resource blocks to combine them to build new things, the advancements tree serves as a walk-through of what to do next. Previous achievements make further achievements possible, often by producing resources needed to build further items."
  },
  {
    "id": 3,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Needs Expectations",
    "subtitle": "Clarify how learned content will be used later -- set up learners’ expectations.",
    "description": "Make it clear how key concepts being learned will be put to use later, for example on a test or final exam. Let players/learners know what to expect so that they can better prepare. ",
    "summary": "Students expect to be tested > no testing expected",
    "questions": "What does the player/learner need to learn to succeed in your game?\n\nDoes the player/learner feel that those things are necessary to succeed in your game?",
    "examples": "Tell your class that there will be a quiz on a reading, rather than simply telling them to do the reading\n\nWhen teaching a player/learner to perform a function, provide examples of future tasks that this skill is needed to complete (“double jump: will be used for collecting butterflies”), rather than teaching in a vacuum\n\nIn Crazy Plant Shop, players/learners need to fulfill customer orders using the knowledge of trait inheritance and plant genetics. The game tells players/learners they will receive mysterious customers’ orders in the very beginning, so players/learners would learn with the expectation. "
  },
  {
    "id": 4,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Recall Practice",
    "subtitle": "Re-expose and test the learned content -- ask for recall.",
    "description": "Re-expose players/learners to core concepts by asking them to recall material. Challenges of recall practice can make learning and retrieval effortful and thereby have positive effects on long-term retention.  ",
    "summary": "Quiz for retrieval practice > study same material",
    "questions": "Do they have to exercise those skills repeatedly?\n\nHow often are they exposed to the tests?",
    "examples": "Give a test summarizing the material, rather than simply studying the same material\n\nGive a “pre-quiz” to expose students to upcoming math concepts and gauge progress, rather than jump straight in\n\nHave a weekly quiz, rather than don’t have any quiz before the final test\n\nUsing flashcards to recall vocabulary learned before, rather than only recall the material learned today\n\nBattleship Numberline uses repetitive drilling (quizzing) to ingrain math concepts in players, with time pressure and a display of average accuracy to add challenges. After learning new skills about math, questions about old skills are still in quizzes."
  },
  {
    "id": 5,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Segmenting",
    "subtitle": "Break down learning into units -- segment the material.",
    "description": "Break material down into units to allow the player/learner to approach the material at their own pace. Plan the amount of new information in discrete units so as not to overwhelm new players/learners with too much new information at once. Also, players/learners don’t have to play the entire game to get the benefit.",
    "summary": "Present lesson in learner-paced segments > as a continuous unit",
    "questions": "What are the tasks players/learners need to do in your game?\n\nDoes a player/learner need to complete an entire task in one sitting or could they stop part way through?\n\nHow can players/learners control their pace?\n\nHow much should they have to do without taking a break?",
    "examples": "Use levels of games rather than a very long game\n\nUse a series of Portuguese lessons on verbs used in different scenarios, rather than a very long, continuous curriculum on all verbs\n\nIn while True: learn(), a simulator game about machine learning, there are many chunked levels of algorithm puzzles instead of a continuous unit, and players/learners can stop and come back any time."
  },
  {
    "id": 6,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Feedback",
    "subtitle": "Provide feedback on performance during learning.",
    "description": "Provide feedback to the player/learner on their performance as they are learning. Timing of feedback may differ depending on the task being performed. Immediate feedback during play can be valuable to encourage or discourage behavior.",
    "summary": "Provide feedback during learning > no feedback provided",
    "questions": "How much feedback relates to their application of target concepts?\n\nHow does a player/learner know how they are doing?\n\nHow often should the feedback be provided?",
    "examples": "If a student does a calculation incorrectly, point out the mistake as it happens, rather than letting it go because it is a difficult problem.\n\nHaving a musician play on the real piano so they can hear the dissonance of a wrong note, rather than having them practice on a printed keyboard.\n\nJobPro: Get Dressed trains players/learners to dress for a job interview. After the player/learner makes their selection they receive detailed feedback about the outfit they chose and its compatibility with the position."
  },
  {
    "id": 7,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Pretraining",
    "subtitle": "Train the players/learners before actual teaching. ",
    "description": "Provide some exposure to key concepts before the actual lesson. players/learners receive prior instruction concerning the components in the to-be-learned system so they can better prepare for the lesson.",
    "summary": "Practice key prior skills before lesson > jump in",
    "questions": "How well will players/learners know these skills before playing your game?\n\nHow well should the players/learners be trained in those prior skills?\n\nHow can you provide players/learners some training in prior skills they aren’t familiar with?",
    "examples": "Have players/learners practice writing one sentence at a time before making them write a paragraph.\n\nIntroduce the components of a car’s braking system before showing a narrated animation explaining how a car’s braking system works.\n\nList the new vocabulary before learning a new article.\n\nCoding for Carrots has a trial round before every official game play. It offers pre-training of the skills that the game wants to test, and it also helps to set an expectation of the difficulty level for the players. "
  },
  {
    "id": 8,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Worked Example",
    "subtitle": "Show players/learners examples of how problems are solved or worked out.",
    "description": "Combine problem-solving practice with reviewing examples of solved problems that illustrate the steps taken to reach a solution. Having students alternate between reviewing worked examples and solving similar problems on their own has been shown to be effective when teaching math, science, and technology.",
    "summary": "Worked examples + problem-solving practice > practice alone",
    "questions": "How could you show them an example of executing the skill correctly?\n\nCan the example break down each of the steps for the player?",
    "examples": "Review code from a few similar projects while determining what approach to do one’s homework\n\nAn algebra textbook provides a worked example for each type of practice problem, rather than providing descriptive text and practice problems only. \n\nIn Anti-Phishing Phil, each module begins with a non-interactive tutorial in which the player/learner is presented with worked examples of the types of problems they will need to solve."
  },
  {
    "id": 9,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Concreteness Fading",
    "subtitle": "Start with concrete examples, gradually move to abstract representations.",
    "description": "Concrete representations can be effective for inciting initial understanding of a concept, but may not support transferring that knowledge to other concepts. Abstract representations may be more difficult to grasp initially, but help foster the ability to apply knowledge in different domains. Therefore, when introducing concepts, use concrete examples first and then draw abstract connections. ",
    "summary": "Concrete to abstract representations > starting with abstract",
    "questions": "What are some ways of bridging the concrete and abstract representations?\n\nHow can you show the players/learners this bridging? By visual instruction, text feedback or other ways?",
    "examples": "Use a concrete example first like “Shelly needs 3 dozen eggs. X = the number of eggs she needs.” rather than directly presenting the abstract formula “X = 3(12).”\n\nPlaying on piano while following along on the diagram of the circle of 5ths, rather than directly reviewing the abstract diagram.\n\nIn Human Resource Machine, a puzzle game with visual programming, commands are first introduced with concrete examples of in/out assembly lines, and abstract functions like loops and conditional are introduced later. "
  },
  {
    "id": 10,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Guided Attention",
    "subtitle": "Guide players/learners to anticipate where to focus their attention. ",
    "description": "When there are many elements provided on the screen, the cognitive load of learning might be high if people don’t know where to pay attention to. Here they need some visual cues, for example, outlining, to help them reduce the cognitive load. It also helps ensure that players/learners do what you want them to do of their own free will.",
    "summary": "include cues about organization > no organization cues",
    "questions": "What are the most important components of the scene that players/learners need to attend to do that thing?\n\nHow can you emphasize them more?",
    "examples": "Provide a long article with outline and headings.\n\nUse descriptive text throughout a diagram illustrating the branches of government to explain how they connect, rather than presenting the diagram directly with terms the player/learner has never heard before. \n\nIn Creature Capture, the player/learner needs to pick a number that meets the requirement of the presented game cue. The game uses arrows and pop up windows to lead players/learners to focus on the important parts."
  },
  {
    "id": 11,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Linking",
    "subtitle": "Highlight links between instructional units or concepts. ",
    "description": "Explicitly call out connections, similarities, and differences between previously learned and new material. Learning is facilitated when new knowledge is integrated into the learner’s world.",
    "summary": "Integrate instructional components > no integration",
    "questions": "What are some links between the skills your game teaches?\n\nHow can you make the connections more explicit?",
    "examples": "When teaching philosophy, make connections between philosophers and compare and contrast their beliefs, rather than giving an overview of each major philosopher.\n\nWhen teaching a new choreograph, compare it with the techniques students have learned.\n\nIn Euclidea, an interactive geometry construction game, similar puzzles are grouped in one chapter, and the same set of tools (lines, perpendiculars, circles, etc.) are provided in different chapters, emphasizing connections between geometric constructs. "
  },
  {
    "id": 12,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Goldilocks",
    "subtitle": "Aim for an optimal difficulty level that is neither too hard nor too easy.",
    "description": "Account for the player’s prior knowledge and skill level when considering how challenging to make your game. When the game is too easy for the player, the student is not challenged and may get bored. When it is too difficult, the student acquires very little and gets frustrated or tunes out.",
    "summary": "Instruct at intermediate difficulty level > too hard or too easy",
    "questions": "How could you make your in-game tasks harder?\n\nHow could you make them easier?",
    "examples": "Design a chemistry game to be grade-level appropriate, otherwise students may find it unapproachable because it involves math far above their grade level\n\nMario Kart balances the different skill levels of players/learners by giving more powerful items, which are used to sabotage other players/learners and reduce the difficulty, to players/learners who are performing not so good."
  },
  {
    "id": 13,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Activate Preconceptions",
    "subtitle": "Prompt players/learners to examine what they already know.",
    "description": "Building upon what players/learners already know, think they know, and/or are interested in, can help contextualize new material and make the game more accessible and engaging. ",
    "summary": "Cue student's prior knowledge > no prior knowledge cues",
    "questions": "What do your players/learners already know about the concept you will introduce?\n\nWhat are some links between the prior knowledge and the new concepts?\n\nHow to help players/learners recall the links?\n\nHow can you help your players/learners see those concepts in a new way?",
    "examples": "Ask students to think about examples of vaporization in daily life before introducing the theory of vaporization.\n\nA Slower Speed of Light is designed to build upon and challenge the average person’s understanding of how light travels. It begins with a very familiar experience: walking through a space at a human-like pace collecting objects. Picking up orbs reduces the speed of light in increments, triggering scientifically accurate visual effects."
  },
  {
    "id": 14,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Immediate Feedback",
    "subtitle": "Provide immediate feedback on errors. ",
    "description": "Learning wrong information can be reduced when feedback is immediate. By correcting mistakes as soon as possible, players/learners will be allowed to revise their memory and understanding without delay.",
    "summary": "Immediate feedback on errors > delayed feedback",
    "questions": "Are the errors immediately fixable? Or does it take more time to fix the error?\n\nHow do players/learners feel when fixing the error? How to make the fixing error experience more joyful?",
    "examples": "The line of code turns red once a student makes a mistake, rather than giving an error message after the student presses the “compile” button.\n\nIn the board game Operation, players/learners perform “surgery” on a doll-shaped board, carefully extracting plastic objects from the body with a goal of not touching the board. If the player/learner slips up and makes contact with the board a buzzer sounds immediately."
  },
  {
    "id": 15,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Interleaving",
    "subtitle": "Interleave the practice of different skills, at the same time or in alternation.",
    "description": "Interleaving will balance the speed (reduced time cost of practice) advantage of recency with the long-term learning advantage of spaced practice. It will lead to better long-term retention in general.",
    "summary": "Intermix practice on different skills > block practice all at once",
    "questions": "How do you currently present them to players?\n\nHow to design for players/learners to practice different skills together?",
    "examples": "In a yoga class, mix both yin and yang practices rather than having long holds only\n\nPractice vocabulary based on the forgetting curve theory, rather than only practicing today’s new vocabulary\n\nIn Ninja Kitchen, the player/learner role plays a ninja server operating a restaurant through a mixture of smaller games targeting different perspectives, including dish washing, food preparing, serving, etc. The harder the game goes, the busier the restaurant runs. The players/learners will practice all kinds of skills interleaved together. "
  },
  {
    "id": 16,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Application",
    "subtitle": "Practice applying newly learned knowledge.",
    "description": "Challenge the player/learner to put their newly acquired knowledge to use solving problems. Knowledge acquiring and applying in varying contexts. ",
    "summary": "Practice applying new knowledge > no application",
    "questions": "What are the components that are most important to remember?\n\nHow to design tasks to help the players/learners practice the same skills under different contexts?",
    "examples": "Practice playing newly learned chords on guitar rather than simply studying additional new chord shapes\n\nIn Septris, the game which trains medical and surgical staff to diagnose, classify, and treat sepsis, players/learners need to apply sepsis skills in different case scenarios. "
  },
  {
    "id": 17,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Variability",
    "subtitle": "Practice with multiple and varied examples.",
    "description": "Use multiple and varied examples to teach and practice the use of abstract concepts. Two situations are never exactly the same, so players/learners should be prepared to apply their knowledge in all the varied situations of life. ",
    "summary": "Practice with varied instances > similar instances",
    "questions": "How to design tasks to help the players/learners practice the same skills under different contexts?\n\nWhat are some different scenarios or examples in which the targeted skill can be applied?",
    "examples": "Using multiple metaphors when explaining a complex concept, otherwise the student may interpret the single metaphor literally\n\nBattleship Numberline has modes for fractions, decimals, percentages, and \"mixed bag,\" which prompt the player/learner to apply the same skill of eyeballing ratios to varied problems."
  },
  {
    "id": 18,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Comparison",
    "subtitle": "Highlight and compare the similarities and differences between examples.",
    "description": "Use multiple examples to explain a new concept, and highlight similarities and differences between the examples. People comparing their performance in two attempts doesn’t account as an application of this principle, because it is not helping players/learners understand a new concept from external materials. ",
    "summary": "Compare multiple instances > only one instance",
    "questions": "How to show the players/learners the similarities/differences among concepts in your game?\n\nHow can your game encourage players/learners to find similarities/differences among the skills/concepts in your game? ",
    "examples": "Point out the similarities and differences of how the same music theory concept is applied in classical, pop, and jazz music examples, rather than using only pop music\n\nIn Spent, players/learners will encounter a series of events to see how hard it is to make a living in poverty. By showing the impact of poverty on education, healthcare, housing, job hunting, etc., the game helps players/learners understand the importance of financial assistance to poor people."
  },
  {
    "id": 25,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Realistic Challenge",
    "subtitle": "Provide realistic rather than theoretical problem-solving.",
    "description": "Emphasize the connections between the game and the real world. Contextualize the game in a meaningful, realistic problem-solving scenario, so that players/learners can more easily transfer their learning and apply the knowledge learned to situations out of the game.",
    "summary": "Real-world problems > abstract problems",
    "questions": "How is what the player/learner does in your game like what they would do in real life? How is it different?\n\nHow will you build the connection between their in-game progress and real-world life?",
    "examples": "In an economics course, let students build a hypothetical portfolio of real stocks and watch those stocks over the course of the semester, rather than simply studying fictional problems of market fluctuation\n\nLet medical students work on genuine medical cases with a problem-based curricula\n\nIn Lift Coach, players/learners can correct how the on-screen character lifts objects in real life cases to avoid unsafe actions, so they can more easily understand the mechanism behind and how to protect themselves in real hard-lifting scenarios. "
  },
  {
    "id": 26,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Metacognition",
    "subtitle": "Guide students to think about their learning processes metacognitively.",
    "description": "Players/learners need explicit training on optimal learning strategies and how to reflect on their own cognitive processes to allocate study time effectively and become aware of what they do not know. These metacognitive skills will help students transfer to new situations without explicit prompting.",
    "summary": "Metacognition supported > no support for metacognition",
    "questions": "How could your game help players/learners manage their own knowledge intentionally?\n\nDo you provide moments for players/learners to reflect on their own knowledge, how could you provide more?",
    "examples": "In a time-management app, encourage the user to set custom goals and reflect upon their progress on a weekly basis.\n\nSurvival of the Best Fit teaches people to understand algorithmic bias, and prompts them to think about their own biases. The game features a series of short segments with periodic breaks to reflect on what just happened and why players/learners made the decisions they made."
  },
  {
    "id": 27,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Explanation",
    "subtitle": "Prompt players/learners to self-explain learned concepts.",
    "description": "Encourage the player/learner to think about their own problem-solving process and challenge, explain, and defend their choices to themselves or others. Explanations provide coherence to the material and justify why information is relevant and important. Therefore, prompting players/learners to reason through the underlying principles can help deepen their understanding of the subject matter.",
    "summary": "Prompt for self-explanation > give explanation > no prompt",
    "questions": "How does a player/learner experience these relationships?\n\nAre players/learners given chances to self-explain how they think these relationships work?",
    "examples": "Have students show their work on an algebra problem is better than simply showing a step-by-step worked problem, which is still better than only presenting the final solution\n\nIn SET, a logical reasoning game, players/learners need to find sets of three cards which share a common feature, such as color or shape. When players/learners see a set they can make within the rules they must explain it to the other players/learners to score."
  },
  {
    "id": 28,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Questioning",
    "subtitle": "Encourage the player/learner to take time to ask deep questions.",
    "description": "Empower your player/learner to embrace and explore uncertainties they encounter. Questions stimulate deep explanations, and may challenge their prior beliefs and assumptions. Training students to ask deep questions can facilitate comprehension of material.",
    "summary": "Time for reflection & questioning > instruction alone",
    "questions": "In what ways could a player/learner question themselves through your game?\n\nHow could you create situations to help the players/learners to question things?\n\nDoes your game provide chances for players/learners to answer their questions?",
    "examples": "Ask students deep questions like “What might the world look like today if the war had ended differently?” rather than “What year did the American Revolutionary War end?”\n\nThe Incredible Machine is a video game where players/learners create Rube Goldberg devices, the chain reaction-type machines that trigger a lot of \"what happens if I do X?\" type of questioning dynamics."
  },
  {
    "id": 29,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Cognitive Dissonance",
    "subtitle": "Present incorrect or alternative perspectives to solve cognitive dissonance.",
    "description": "Present incorrect or alternative perspectives of the subject matter to afford the player/learner the opportunity to form arguments around key concepts. Reasoning through why an incorrect response is incorrect or how alternative perspectives differ can help to form a more general understanding of a domain.",
    "summary": "Present incorrect or alternative perspective > only correct",
    "questions": "How can the player/learner make mistakes or misuse of the material?\n\nDoes your game show the players/learners alternatives to consider?\n\nHow many ways are there to approach the challenges in your game? How many are players/learners likely to encounter themselves?",
    "examples": "Show an example of a common misconception and explain why it is false rather than giving only correct examples\n\nIn Odyssey - The Invention of Science, players/learners progress through a series of puzzles that replicate ancient experiments of celestial physics, and are challenged to reconcile whether ancient people’s conclusions match the current understanding or not. "
  },
  {
    "id": 30,
    "categoryId": 1,
    "category": "Learning Principle",
    "principle": "Interest",
    "subtitle": "Provide instruction relevant to student interests.",
    "description": "Engage players/learners by structuring content around their interests and goals. players/learners who have intrinsic motivations to play the game would make sense of and engage more with the material.",
    "summary": "Instruction relevant to student interests > not relevant",
    "questions": "Could your players/learners achieve their goals through your game?\n\nDoes your player/learner have a personal stake in their transformation?",
    "examples": "Allow guitar students to choose their own songs to learn rather than forcing a set of songs that they are not interested in\n\nIn Cashflow, an online investigating game, players/learners choose a dream as their goal in the game, for example saving the ocean animals, owning a personal jet, etc. The dream selection based on personal interest will motivate players/learners to earn more money in the game in order to accomplish their goal."
  }
]